export type Subject = '스포츠' | '음식' | '동물'

export type Keyword = {
  subject: Subject
  keyword: string
}

const keywords: Record<Subject, string[]> = {
  스포츠: [
    '축구',
    '야구',
    '농구',
    '배구',
    '탁구',
    '테니스',
    '볼링',
    '골프',
    '스키',
    '스노우보드',
    '배드민턴',
    '등산',
    '수영',
  ],
  동물: [
    '고양이',
    '강아지',
    '토끼',
    '햄스터',
    '거북이',
    '뱀',
    '고슴도치',
    '펭귄',
    '코끼리',
    '사자',
    '호랑이',
    '여우',
    '늑대',
    '코뿔소',
    '사슴',
    '기린',
    '코알라',
    '표범',
    '원숭이',
    '하마',
    '얼룩말',
    '말',
    '돼지',
    '소',
    '양',
    '닭',
    '오리',
    '앵무새',
    '참새',
    '까마귀',
    '독수리',
    '매',
    '부엉이',
    '두루미',
    '물개',
    '고래',
    '상어',
    '돌고래',
  ],
  음식: [
    '피자',
    '치킨',
    '햄버거',
    '족발',
    '떡볶이',
    '라면',
    '김밥',
    '초밥',
    '스테이크',
    '소시지',
    '샐러드',
    '햄',
    '닭가슴살',
    '닭갈비',
    '삼겹살',
    '갈비',
    '불고기',
    '순대',
    '김치찌개',
    '된장찌개',
    '부대찌개',
    '비빔밥',
    '짜장면',
    '짬뽕',
    '탕수육',
    '볶음밥',
  ],
}

// const keywords: Keyword[] = [
//   {
//     subject: '스포츠',
//     keyword: '축구',
//   },
//   {
//     subject: '스포츠',
//     keyword: '야구',
//   },
//   {
//     subject: '스포츠',
//     keyword: '농구',
//   },
//   {
//     subject: '스포츠',
//     keyword: '배구',
//   },
//   {
//     subject: '스포츠',
//     keyword: '탁구',
//   },
//   {
//     subject: '스포츠',
//     keyword: '테니스',
//   },
//   {
//     subject: '스포츠',
//     keyword: '볼링',
//   },
//   {
//     subject: '스포츠',
//     keyword: '골프',
//   },
//   {
//     subject: '스포츠',
//     keyword: '스쿼시',
//   },
//   {
//     subject: '스포츠',
//     keyword: '스키',
//   },
//   {
//     subject: '스포츠',
//     keyword: '스노우보드',
//   },
//   {
//     subject: '스포츠',
//     keyword: '스케이트보드',
//   },
//   {
//     subject: '스포츠',
//     keyword: '배드민턴',
//   },
//   {
//     subject: '스포츠',
//     keyword: '수영',
//   },
//   {
//     subject: '스포츠',
//     keyword: '등산',
//   },
//   {

//   }
// ]

export default keywords
